[
  {
    "awardName": "MPOWER Monthly Scholarship",
    "nationality": "Unrestricted",
    "hostCountries": "Canada and United States",
    "link": "https://www.iefa.org/scholarships/scholarships/3596/MPOWER_Monthly_Scholarship",
    "sponsor": "MPOWER Financing",
    "description": "We’re thrilled to announce our Summer Series of Scholarships! MPOWER will be awarding  $8,000 USD this summer to support 12 international students in funding their educational dreams.\n\nHow this works:\n\nOn the first day of each month this summer, check out this page to find out the scholarship theme for the month. \nYou can subscribe to our student newsletter to be alerted when the new scholarship is announced.\nBe sure to apply quickly! Applications will be open until the last Friday of the month.",
    "otherCriteria": "Deadline: Last Friday of the Month at 11:59 PM EST\n\nAwards:\n\nGrand Prize: $1,000\nHonorable Mentions (2): $500\nEligibility Requirements:\n\nBe admitted to, or enrolled in, a full-time degree program at one of the schools mpower supports in the U.S. or Canada, and\nBe an international student permitted to legally study in the U.S. or Canada, as applicable:\nFor study in the U.S., this means that the applicant meets one of these criteria:\nHas a valid visa that permits study in the U.S., or\nIs protected under the Deferred Action for Childhood Arrivals (DACA)\nFor study in Canada, this means the applicant must meet the following criteria:\nHas a valid Canadian study permit\nU.S. citizens wishing to study in the U.S. and Canadian citizens wishing to study in Canada are not eligible for this scholarship.",
    "fieldsOfStudy": "Unrestricted",
    "awardAmount": "$1,000, $500, $500"
  },
  {
    "awardName": "Canadian Journalism Scholarship",
    "nationality": "Unrestricted",
    "hostCountries": "Canada",
    "link": "https://www.iefa.org/scholarships/scholarships/3559/Canadian_Journalism_Scholarship_",
    "sponsor": "Investintech.com, The Canadian Association of Journalists (CAJ)",
    "description": "The scholarship aims to encourage and support all students in Canada with journalism skills by helping them with the costs of their education. Furthermore, the scholarship is intended to serve as a way to help prepare students for a career path in data journalism.",
    "otherCriteria": "The Investintech - CAJ Data Journalism Scholarship is open to students who show an interest in data journalism. Eligible students must meet the following requirements:\n\n-Pursuing a course of studies or program leading to a diploma, undergraduate or graduate degree.\nShow evidence of their journalism skills and interest, such as having a published news story, or be working for a college publication, etc.\n-Currently accepted to or enrolled in a college or university in Canada.\n\nThe winning submission will be one that shows strong data analysis skills combined with excellent storytelling techniques. Submissions must include:\n\n-An example of a work of journalism that shows the application of data skills (e.g. use of spreadsheets, web scraping, use of mapping tool). The submissions must include at least one data visualization (e.g. a map or a chart) produced by the student.\n-An explanation of what you did and how you did it, including the resources you used and how the data was compiled. For submissions that were part of a group project, applicants must explain their role, the skills they used in fulfilling that role, and the specific parts of the story, or stories, that their contribution influenced.\n\nSubmitted work may be a published item, class assignment or even an item on a personal blog.\n\n-Work must have been produced within one calendar year of the scholarship closing date.\n-A single submission of individual work is preferred. If the submitted item is produced as part of a team of two or more, the applicant must submit a detailed explanation about their contribution and their own proof of work.\n-Previous winners are not eligible to apply.",
    "fieldsOfStudy": "Unrestricted",
    "awardAmount": "$1,000 CAD"
  },
  {
    "awardName": " Six Scholarship for exclusive Space Executive Master Programmes",
    "nationality": "Unrestricted",
    "hostCountries": "Netherlands",
    "link": "https://www.iefa.org/scholarships/scholarships/3702/_Six_Scholarship_for_exclusive_Space_Executive_Master_Programmes_",
    "sponsor": "Luiss Business School in Amsterdam",
    "description": "Luiss Business School in Amsterdam, one of the most exclusive business schools in the world, located in the heart of Amsterdam, is awarding 6 scholarships that will cover 50% of the tuition fee for the Executive Master Degrees in Space Entrepreneurship and Space Business Management. \n\nThe first edition of unique and exclusive Space Executive Master Programmes are organized and managed in collaboration with most important industry players and professionals.  Students gain invaluable experience over twelve months and expand their perspective on what it means to be a space business manager or space entrepreneur.\n\nCandidates interested in Master in Space Entrepreneurship or Master in Space Business Management, should apply before the deadline.\n\nIn order to become eligible for a scholarship, candidates must be admitted to one of the two executive space masters’ degree programmes: Master in Space Entrepreneurship or Master in Space Business Management.\n\nFor more information on scholarships, please click the link below.",
    "otherCriteria": "The contest is open to students with an Undergraduate Degree or Bachelors’ Degree. Also, at least one year of working experience is required to participate. The Scholarships are merit based and candidates will be evaluated according to their academic and professional background, the results of the admission tests and their motivational letter.",
    "fieldsOfStudy": "Business/Management and Science",
    "awardAmount": "8.000€"
  },
  {
    "awardName": "New International Scholarship Opportunities Monthly",
    "nationality": "Unrestricted",
    "hostCountries": "Canada and United States",
    "link": "https://www.iefa.org/scholarships/scholarships/3676/New_International_Scholarship_Opportunities_Monthly",
    "sponsor": "MPOWER Financing",
    "description": "Monthly Scholarships for International Students\n\nMPOWER is awarding US $48,000 this year to help 36 international students fund their education dreams.\n\nHow it works:\n\nOn the first day of each month, check out the page linked below to find out the scholarship theme for the month. \n\nBe sure to apply quickly! Each Monthly contest ends on the last day of the month at 11:59 PM EST.",
    "otherCriteria": "Awards: Grand Prize: $2,000,  Honorable Mentions (2): $1,000\n\nEligibility Requirements: \nBe admitted to, or enrolled in, a full-time degree program at a U.S. or Canadian school that MPOWER supports,  \n\nAnd be an international student permitted to legally study in the U.S. or Canada, as applicable:\n\nFor study in the U.S., this means that the applicant meets one of these criteria:\nHas a valid visa that permits study in the U.S., or\nIs protected under the Deferred Action for Childhood Arrivals (DACA)\nFor study in Canada, this means the applicant must meet the following criteria:\nHas a valid Canadian study permit\nU.S. citizens who wish to study in the U.S. and Canadian citizens who wish to study in Canada are not eligible for this scholarship.",
    "fieldsOfStudy": "Unrestricted",
    "awardAmount": "$2,000"
  },
  {
    "awardName": "Chasing Dreams Scholarship",
    "nationality": "China",
    "hostCountries": "Canada and United States",
    "link": "https://www.iefa.org/scholarships/scholarships/3688/Chasing_Dreams_Scholarship",
    "sponsor": "MPOWER Financing",
    "description": "MPOWER Financing's Chasing Dreams Scholarship celebrates promising international graduate students from China, with awards up to US$5,000. This scholarship is open to international graduate students with Chinese citizenship admitted to, or enrolled in, a full-time degree program at a U.S. or Canadian school that MPOWER supports. You must be permitted to legally study in the U.S. or Canada, as applicable:\n\nFor study in the U.S., the applicant has a valid visa that permits study in the U.S. or is a U.S. permanent resident (Green Card holder). For study in Canada, the applicant has a valid Canadian study permit. \n\nTo apply, submit an essay answering the following question: Please tell us how your cultural background informs your educational journey and/or professional goals, and describe how your graduate degree will help you make an impact in your field.",
    "otherCriteria": "",
    "fieldsOfStudy": "Unrestricted",
    "awardAmount": "US$5,000"
  },
  {
    "awardName": "Rotary Peace Fellowships",
    "nationality": "Unrestricted",
    "hostCountries": "Australia, Japan, Sweden...",
    "link": "https://www.iefa.org/scholarships/scholarships/3573/Rotary_Peace_Fellowships_",
    "sponsor": "Rotary International",
    "description": "The fully funded Rotary Peace Fellowship, which covers tuition and living expenses, increases the capacity of existing leaders to prevent and resolve conflict by offering academic training, field experience, and professional networking.\n\nUp to 90 fellows are selected every year in a globally competitive process based on personal, academic, and professional achievements. Fellows earn either a master’s degree or a post-graduate diploma in peace and development studies at one of our Rotary Peace Centers, located at leading universities around the world. \n\nOver 1,600 program alumni are working in more than 140 countries as leaders in national governments, nongovernmental organizations, education and research, law enforcement, and international organizations such as the United Nations.\n\nMaster’s degree \n-\t15-24 month program, small-group classroom learning, in fields related to peace and development \n-\tIntended for leaders near the start of their careers\n-\t50 fellows selected annually to study at one of five Rotary Peace Centers at partner universities, which offer interdisciplinary curricula with research-informed teaching\n-\t2-3 month field study experience to develop practical skills\n-\tFellows connect with an international cohort of fellows, thought leaders, and a global network of Rotarians\n\nProfessional development certificate\n-\tYearlong program for working professionals that blends online learning, in-person classes, and an independent project, based at a Rotary Peace Center in Thailand or Uganda\n-\tIntended for social change leaders with extensive experience working in peace-related fields\n-\t80 fellows selected annually to earn a post-graduate diploma or certificate in peace and development studies\n-\tInterdisciplinary program includes a two-week online preliminary course, 10 weeks of on-site courses with field studies, a nine-month period during which fellows implement a social change initiative (with interactive online sessions), and an on-site capstone seminar",
    "otherCriteria": "Applications for this round need to be submitted by 15 May. Please write to the email below with questions.\n\nQualified candidates must:  \n-\tHave three years of related work experience for the master’s program (five years for the Duke program)\n-\tHave five years of related work experience for the certificate program and be able to explain how their plan to promote peace aligns with Rotary’s mission (Candidates for Makerere University must either be from Africa, have worked in Africa, or work with African communities or initiatives outside the continent.)\n-\tBe proficient in English\n-\tHave a bachelor’s degree \n-\tDemonstrate leadership skills\n-\tHave a strong commitment to cross-cultural understanding and peace\n\nCandidates must have at least three years between the completion of their most recent academic degree program (undergraduate or graduate degree) and their intended start date for the fellowship. Candidates currently enrolled in an undergraduate or graduate program are not eligible to apply.",
    "fieldsOfStudy": "Other and Sustainable Development",
    "awardAmount": "Fully funded"
  },
  {
    "awardName": "Marie Sklodowska-Curie Postdoctoral Fellowship",
    "nationality": "Unrestricted",
    "hostCountries": "Italy",
    "link": "https://www.iefa.org/scholarships/scholarships/3722/Marie_Sklodowska-Curie_Postdoctoral_Fellowship",
    "sponsor": "European Commission",
    "description": "Marie Sklodowska-Curie Postdoctoral Fellowship at Department of Infectious, Tropical Diseases and Microbiology of the IRCCS Sacro Cuore Don Calabria Hospital\n\nFor the current Marie Sklodowska-Curie Postdoctoral Fellowships call, Sacro Cuore Don Calabria Hospital is pleased to support excellent researcher who are interested in submitting an application for the Marie Sklodowska-Curie Postdoctoral Fellowship call in the area of:\n1.\tParasitology, with main focus on schistosomiasis and strongyloidiasis, both in the non-endemic setting (migrants’ and travellers’ health) and in endemic areas (infield collaborations\n2.\tEmerging/re-emerging viral infections, mainly arboviral infections, both in the non-endemic setting (migrants’ and travellers’ health) and in endemic areas (infield collaborations)\n\nThe Department of Infectious, Tropical Diseases and Microbiology of the IRCCS Sacro Cuore Don Calabria Hospital offers a truly international and multi-disciplinary workplace. Thanks to a world-wide research network you will be involved in a continuous fruitful exchange of experiences.\n\nWho are we?\n\nThe Department of Infectious, Tropical Diseases and Microbiology is a referral centre for parasitic diseases In Italy. It is a WHO collaborating centre for strongyloidiasis and other Neglected Tropical Diseases. The Department comprises in and outpatient services and a diagnostic area. Translational research in the infectious disease field is carried out, mainly concerning parasitology, virology and emerging pathogens. Also, collaborations with low and middle income countries are ongoing, with infield activities. Cutting-edge equipment for molecular and cellular biology, immunoassays, protein analyses and BSL2/BLS3 cell culture are available.\n\nEligibility criteria\n1.\tThe researcher must be in possession of a doctoral degree or have successfully defended their doctoral thesis before call deadline to the European Commission (11/09/2024)\n2.\tThe researcher must have maximum 8 years of research experience from date of award of the (first) doctoral degree.\n3.\tThe researcher can be of any nationality and must not have resided or carried out their main activity (work, studies, etc.) in Italy for more than 12 months in the 3 years immediately before the call deadline (11/09/2024).\n\nApplication \nCandidates interested in this position should submit their Expression of Interest application at the email address below any time before 30/06/2024 (internal deadline), sending:\n\n1.\ta detailed curriculum vitae, including the list of publications;\n2.\tA motivation letter;\n3.\tBrief 1-page proposal of your future research project\n\nThe selected candidates will be supported in the development of their project proposals that must be submitted to the European Commission by September 11th, 2024 - h. 17.00 CET.\n\nMore information on the Marie Sklodowska-Curie Postdoctoral Fellowships call is available on the EU-MSCA Web Site.",
    "otherCriteria": "Eligibility criteria\n1.\tThe researcher must be in possession of a doctoral degree or have successfully defended their doctoral thesis before call deadline to the European Commission (11/09/2024)\n2.\tThe researcher must have maximum 8 years of research experience from date of award of the (first) doctoral degree.\n3.\tThe researcher can be of any nationality and must not have resided or carried out their main activity (work, studies, etc.) in Italy for more than 12 months in the 3 years immediately before the call deadline (11/09/2024).",
    "fieldsOfStudy": "Health Professions, Other and Medicine",
    "awardAmount": "Varies"
  },
  {
    "awardName": "Master Scholarships in Fashion Food and Business",
    "nationality": "Austria, Belgium, Bulgaria...",
    "hostCountries": "Netherlands",
    "link": "https://www.iefa.org/scholarships/scholarships/3720/Master_Scholarships_in_Fashion_Food_and_Business",
    "sponsor": "LUISS Business School in Amsterdam",
    "description": "Luiss Business School in Amsterdam offers 8 scholarships - 2 for each course - covering 50% of the tuition fees, for those aspiring to pursue a full-time Master's program in International Management, Digital Entertainment Business, Fashion and Luxury Business and Food and Wine Business\n\nHow to participate? Create visual, or video presentation connected to the theme 'Let’s make a better world'. Your challenge is to design a prompt using AI tool(s) - Artificial Intelligence -  in a discipline of your choice!!",
    "otherCriteria": "The contest is exclusively open to individuals possessing a bachelor's degree or an equivalent qualification. Additionally, candidates must hold an EU Passport.",
    "fieldsOfStudy": "Business/Management, Communications, Fashion, Marketing and Culinary Arts",
    "awardAmount": "50% of the tuition fee"
  },
  {
    "awardName": "MAGIC Grants Cryptocurrency Scholarship",
    "nationality": "Unrestricted",
    "hostCountries": "Unrestricted",
    "link": "https://www.iefa.org/scholarships/scholarships/3718/MAGIC_Grants_Cryptocurrency_Scholarship",
    "sponsor": "Multidisciplinary Academic Grants in Cryptocurrencies",
    "description": "MAGIC Grants offers undergraduate scholarships to students who are interested in cryptocurrencies (Bitcoin, Ethereum, stablecoins, blockchains, etc). This year, three (3) recipients will each receive $2,000 ($1,000 per semester) paid directly to the educational institution.\n\nWe welcome worldwide applicants, not just US students!\n\nApplications are due 22 July. Recipients will be announced in early August.\n\nMore information and to apply see the link below.",
    "otherCriteria": "",
    "fieldsOfStudy": "Unrestricted",
    "awardAmount": "2000"
  },
  {
    "awardName": "MPOWER Women in STEM Scholarship",
    "nationality": "Unrestricted",
    "hostCountries": "Canada and United States",
    "link": "https://www.iefa.org/scholarships/scholarships/3589/MPOWER_Women_in_STEM_Scholarship",
    "sponsor": "MPOWER Financing",
    "description": "Scholarships awarded annually to female international/DACA students who are currently enrolled or accepted to study full-time in a STEM degree program at a program MPOWER supports in the United States or Canada.\n\nAwards:\n\nGrand Prize: $3,000\nHonorable Mentions (2): $1,000 and $500\n\nEligibility Requirements:\n\n- Be accepted at, or enrolled in, a full-time degree program at a U.S. or Canadian school that MPOWER supports, and\n- Be an international student allowed to legally study in the U.S. or Canada, as applicable:\n\nFor study in the U.S., this means that the applicant meets one of these criteria:\n- Has a valid visa that permits study in the U.S.\n- Is protected under the Deferred Action for Childhood Arrivals (DACA)\n- Is a U.S. permanent resident (Green Card holder)\n\nFor study in Canada, this means the applicant meets one of these criteria:\n- Is a Canadian permanent resident\n- Has a valid Canadian study permit\n\nWe have created this scholarship specifically for international and DACA students. Therefore, U.S. citizens wishing to study in the U.S. and Canadian citizens wishing to study in Canada are not eligible for this scholarship.",
    "otherCriteria": "STEM includes any degree programs related to Science, Technology, Engineering, and Mathematics.",
    "fieldsOfStudy": "Biology/Life Sciences, Computer & Information Systems, Engineering, Health Professions, Mathematics...",
    "awardAmount": "$5,000"
  },
  {
    "awardName": "Lisa Maskell Call for Doctoral Scholarships 2025",
    "nationality": "Unrestricted",
    "hostCountries": "South Africa",
    "link": "https://www.iefa.org/scholarships/scholarships/3723/Lisa_Maskell_Call_for_Doctoral_Scholarships_2025",
    "sponsor": "Gerda Henkel Foundation",
    "description": "The Faculty of Arts and Social Sciences at Stellenbosch University, in partnership with the Gerda Henkel Foundation, is pleased to announce a limited number of full-time scholarships for PhD studies.\nDoctoral scholarships are available for research projects in primarily the historical humanities, in particular to support research projects in the following fields:\n• Archaeology\n• History\n• Historical Islamic Studies\n• Art History\n• History of Law\n• Prehistory and Early History\n• History of Science\nResearch topics from areas such as cultural studies, political science, and social sciences that explore current issues in a larger historical context, or consciously focus on topics of relevance to the present or the future, such as forced migration, or democracy, are also eligible for support.",
    "otherCriteria": "• Applicants from African countries. Priority will be given to qualifying candidates from PANGeA partner institutions.\n• Applicants should have obtained 70% in the final year of the previous completed degree.\n• Applicants are expected to provide a sample of their writing with their application:\no MA thesis for PhD applicants\no Any published academic articles related to your application.\n• At the date of application, applicants must not be older than 35 to apply for a PhD scholarship.\n• Applicants must be able to commence studies in February 2025\n• Applicants must apply to study at Stellenbosch University in addition to this scholarship application. Apply to the university at the link below.\n• Applicants are required to contact the department that they intend studying in and to obtain a letter of support indicating that there is supervisory capacity for their research project. This letter of recommendation must be submitted as part of this application. Departments-centres - Faculty of Arts & Social Sciences\n• Applicants from institutions within the PANGeA network, must obtain a nomination letter from their institution and submit the letter as part of this application.",
    "fieldsOfStudy": "Cultural Studies, Other, History and Liberal Arts/Humanities",
    "awardAmount": "R450 000 over three years"
  },
  {
    "awardName": "LCI Barcelona Design Scholarship",
    "nationality": "Unrestricted",
    "hostCountries": "Spain",
    "link": "https://www.iefa.org/scholarships/scholarships/3717/LCI_Barcelona_Design_Scholarship",
    "sponsor": "LCI School of Design and Visual Arts",
    "description": "LCI School of Design and Visual Arts invites students and professionals to participate to the contest \"Design for planet centered and human future\" and win one of the 10 master scholarships for those aspiring to pursue a full-time Master's program in Interaction Design and Immersive Experiences, Master in Management and Direction of Fashion Companies, Master in Fashion Marketing, Communication and Event Planning, Master in 3D Animation and VFX, and Master in Branding and Brand Strategy\n\nCandidates should use their own expertise and creativity to design a prompt - text + visual or video - connected with the theme and develop a concept with the help of AI that can contribute to design a better world. \n\nFor information on scholarships and to apply, please click the link below.",
    "otherCriteria": "The contest is open to all candidates aged between 21 and 44 years in possession of a bachelor degree or equivalent qualification.",
    "fieldsOfStudy": "Architecture & Design, Business/Management, Communications, Fashion, Marketing...",
    "awardAmount": "10,000 Euro"
  },
  {
    "awardName": "PlagiarismSearch.com Essay Contest",
    "nationality": "Unrestricted",
    "hostCountries": "Unrestricted",
    "link": "https://www.iefa.org/scholarships/scholarships/3714/PlagiarismSearch.com_Essay_Contest",
    "sponsor": "plagiarismsearch.com",
    "description": "The scholarship PlagiarismSearch.com, offers students to showcase their writing skills by participating in a competition and getting a chance to win $1000.  All students need to do is write a 500-word essay on one of the specified topics that relate to the importance of academic integrity, especially in the context of modern challenges such as AI and plagiarism, and attach any valid document proving your student status and submit it along with the application form at the link below.\nThe scholarship program is annual.",
    "otherCriteria": "Only students attending colleges or universities can participate in the program, only 1 winner, 18+ years old, each applicant may submit only one essay, English language only, with clear deadlines.",
    "fieldsOfStudy": "Unrestricted",
    "awardAmount": "$1,000"
  }
]